In [63]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [64]:
%cd /content/drive/My\ Drive/Colab\ Notebooks/data/Titanic
# change directory
%pwd  # Ben neredeyim komutu
!ls    # İçerisinde ne var

/content/drive/My Drive/Colab Notebooks/data/Titanic
gender_submission.csv  test.csv  train.csv

In [65]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_absolute_error
import statsmodels.api as sm
from statsmodels.tools.eval_measures import mse, rmse

%matplotlib inline
pd.options.display.float_format = '{:.3f}'.format

import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm
from sklearn import linear_model
import math
#from matplotlib.mlab import PCA as mlabPCA
from sklearn.preprocessing import StandardScaler
from sklearn.decomposition import PCA
from sqlalchemy import create_engine
pd.options.display.max_columns = None
pd.options.display.max_rows = None
import warnings

warnings.filterwarnings('ignore')

%matplotlib inline
pd.options.display.float_format = '{:.3f}'.format

In [66]:
original_data = pd.read_csv("train.csv")
data=original_data.copy()
original_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000,1,0,A/5 21171,7.250,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000,1,0,PC 17599,71.283,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000,0,0,373450,8.050,NaN,S

In [67]:
X=data[['Pclass','Sex','SibSp','Parch','Fare','Embarked']]
X.head()
Y=data['Survived']
Y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [68]:
X=pd.get_dummies(X,prefix_sep='_',drop_first=True)
X.head()

   Pclass  SibSp  Parch   Fare  Sex_male  Embarked_Q  Embarked_S
0       3      1      0  7.250         1           0           1
1       1      1      0 71.283         0           0           0
2       3      0      0  7.925         0           0           1
3       1      1      0 53.100         0           0           1
4       3      0      0  8.050         1           0           1

In [69]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      891 non-null    int64
 1   SibSp       891 non-null    int64
 2   Parch       891 non-null    int64
 3   Fare        891 non-null    float64
 4   Sex_male    891 non-null    uint8
 5   Embarked_Q  891 non-null    uint8
 6   Embarked_S  891 non-null    uint8
dtypes: float64(1), int64(3), uint8(3)
memory usage: 30.6 KB

In [70]:
#X['Age'].unique()

In [71]:
#X = X[~np.isnan(X['Age'])]

In [72]:
#X['Age'].unique()

In [73]:
X.head()

   Pclass  SibSp  Parch   Fare  Sex_male  Embarked_Q  Embarked_S
0       3      1      0  7.250         1           0           1
1       1      1      0 71.283         0           0           0
2       3      0      0  7.925         0           0           1
3       1      1      0 53.100         0           0           1
4       3      0      0  8.050         1           0           1

In [74]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      891 non-null    int64
 1   SibSp       891 non-null    int64
 2   Parch       891 non-null    int64
 3   Fare        891 non-null    float64
 4   Sex_male    891 non-null    uint8
 5   Embarked_Q  891 non-null    uint8
 6   Embarked_S  891 non-null    uint8
dtypes: float64(1), int64(3), uint8(3)
memory usage: 30.6 KB

In [75]:
from sklearn.linear_model import LogisticRegression
log_reg = LogisticRegression()

In [76]:
from sklearn.model_selection import train_test_split
X_eğitim, X_test, Y_eğitim, Y_test =  train_test_split(X, Y, test_size=0.20, random_state=111)

In [77]:
log_reg.fit(X_eğitim, Y_eğitim)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [78]:
egitim_dogruluk = log_reg.score(X_eğitim, Y_eğitim)
test_dogruluk = log_reg.score(X_test, Y_test)
print('One-vs-rest', '-'*20, 
      'Modelin eğitim verisindeki doğruluğu : {:.2f}'.format(egitim_dogruluk), 
      'Modelin test verisindeki doğruluğu   : {:.2f}'.format(test_dogruluk), sep='\n')

One-vs-rest
--------------------
Modelin eğitim verisindeki doğruluğu : 0.79
Modelin test verisindeki doğruluğu   : 0.80

In [79]:
log_reg_mnm = LogisticRegression(multi_class='multinomial', solver='lbfgs')
log_reg_mnm.fit(X_eğitim, Y_eğitim)
egitim_dogruluk = log_reg_mnm.score(X_eğitim, Y_eğitim)
test_dogruluk = log_reg_mnm.score(X_test, Y_test)
print('Multinomial (Softmax)', '-'*20, 
      'Modelin eğitim verisindeki doğruluğu : {:.2f}'.format(egitim_dogruluk), 
      'Modelin test verisindeki doğruluğu   : {:.2f}'.format(test_dogruluk), sep='\n')

Multinomial (Softmax)
--------------------
Modelin eğitim verisindeki doğruluğu : 0.79
Modelin test verisindeki doğruluğu   : 0.80

In [80]:
C_değerleri = [0.001,0.01,0.1,1,10,100, 1000]
dogruluk_df = pd.DataFrame(columns = ['C_Değeri','Doğruluk'])

dogruluk_değerleri = pd.DataFrame(columns=['C Değeri', 'Eğitim Doğruluğu', 'Test Doğruluğu'])

for c in C_değerleri:
    
    # Apply logistic regression model to training data
    lr = LogisticRegression(penalty = 'l2', C = c, random_state = 0)
    lr.fit(X_eğitim,Y_eğitim)
    dogruluk_değerleri = dogruluk_değerleri.append({'C Değeri': c,
                                                    'Eğitim Doğruluğu' : lr.score(X_eğitim, Y_eğitim),
                                                    'Test Doğruluğu': lr.score(X_test, Y_test)
                                                    }, ignore_index=True)
display(dogruluk_değerleri)

   C Değeri  Eğitim Doğruluğu  Test Doğruluğu
0     0.001             0.678           0.693
1     0.010             0.708           0.743
2     0.100             0.795           0.793
3     1.000             0.795           0.804
4    10.000             0.795           0.804
5   100.000             0.795           0.804
6  1000.000             0.795           0.804